[
  {
    "authorName": "Marwa Sharaf",
    "authorLink": "https://www.facebook.com/marwa.sharaf.5",
    "link": "https://www.facebook.com/groups/2401660223266519/permalink/2789443484488189/",
    "date": "1583951755",
    "message": "السلام عليكم\n\nابتداء من الاسبوع القادم ها نشتغل كل سكشن فى ميعاده الرسمى اللى نزل فى الجدول وكل سكشن مدته 45 دقيقه فقط\n\nولن يسمح بحضور اى طالب خارج سكشنه او بعد ميعاد سكشنه ولو بدقيقه واحده\n\nوكل اسبوع ها نرفع الشيت المطلوب بدرى وتييجوا مجهزين المعادلات وtruth table and VHDL code\n\nكل طالب ها يشتغل على جهاز لوحده واللى مش مجهز الكود يفضل ما يحضرش السكشن\n\nسيتم مناقشه كل طالب على حده فى الكود اثناء التنفيذ.\n\nالشيت الاول تم رفعه من قبل مطلوب حل المسأله الاخيره وتسليمها الاسبوع القادم معادلات + truth table+ complete VHDL Code\n\nالشيت التانى مرفق هنا المطلوب حل اخر مسألتين ك ريبورت وتسليمها الاسبوع القادم مع مسأله الشيت الاول\n\nااخر ميعاد للتسليم الاسبوع القادم كل طالب فى سكشنه وبعد السكشن مش ها استلم من اى طالب\n\nكل سكشن ها يتم اختيار بعض الناس لتنفيذ مسائل من الكويز وشرح الكود\n\nالغياب سوف يتم اخذه على شغل داخل السكشن واللى مش ها يشتغل وينفذ الكود مالوش غياب\n\nواخيرا الاسبوع القادم مطلوب تحضير الكود لاول مسألتين من الشيت التانى وسيتم التنفيذ العملى من اول دقيقه فى السكشن حتى نهايته بدون شرح اى اكواد\nبالنسبه للناس اللى محضرتش النهارده السكشن كان شرح واخراج المعادلات وده كان اضافه منى عشان تستفادوا بس ده المفروض شغلكوا انتوا على حسب اوامر استاذ الماده\nوابتداء من الاسبوع القادم ده اللى ها يتم انتوا اللى ها تخرجوا المعادلات والكود"
  },
  {
    "authorName": "Moe Sharshar",
    "authorLink": "https://www.facebook.com/mohamed.sharshar.5",
    "link": "https://www.facebook.com/groups/2401660223266519/permalink/2772382469527624/",
    "date": "1583235050",
    "message": "السلام عليكم...بالنسبة لمحاضرة ال FPGA ..ال د. رمضان قال لنا نشوف ميعاد الأربعاء أو الخميس مناسب لينا بديل لمحاضرة انهارده اللي ضاعت...فقط هذا الأسبوع..الميعادين المتاحين هما الأربعاء 13:30 أو الخميس 13:30\nمع الأخذ في الاعتبار ان يوم (الأربعاء) (بكرا) فيه S.W. Lab الساعة 9:00 ..واحتمال سكشن Image Processing بس  م. علا يونس لغاية دلوقتي مكلمتش حد ☹️\nأما بالنسبة ل(الخميس) عندنا محاضرتين S.W. Eng و Image ... من 9:00 ل 12:00 ..وفيه سكشنين عندهم FPGA\n\nالمطلوب مننا نختار اليوم المناسب لينا في ال Poll دا..علشان أبلغ د. رمضان.\n"
  },
  {
    "authorName": "Marwa Sharaf",
    "authorLink": "https://www.facebook.com/marwa.sharaf.5",
    "link": "https://www.facebook.com/groups/2401660223266519/permalink/2766804376752100/",
    "date": "1583000337",
    "message": "السلام عليكم\n\nان شاء الله ها نشتغل الاحد غدا لماده fpga سكشن 1 من 12:12.45 وسكشن 2 من 12.45:1.5 بدل مواعيد يوم الاثنين وده لهذا الاسبوع فقط\n\nم جمال مش ها يشتغل غدا واحنا ها نشتغل مكانه\n\nبالتوفيق"
  },
  {
    "authorName": "Marwa Sharaf",
    "authorLink": "https://www.facebook.com/marwa.sharaf.5",
    "link": "https://www.facebook.com/groups/2401660223266519/permalink/2758401204259084/",
    "date": "1582659111",
    "message": "السلام عليكم\n\nبالنسبه لمواعيد معمل fpga هى كالتالى:\n\nsec 1 : 10.5:11.15 يوم الاتنين\n\nsec 2 :11.15:12\n\nاما سكشن 3و4 يوم الخميس كالتالى :\n\nsec 3: 12:12.45\n\nsec 4: 12.45:1.5\n\nكل سكشن ها يشتغل لمده ساعه الا ربع عشان كده ها ارفع الشيت والمطلوب انكوا تخرجوا المعادلات وtruth table لاول مسألتين فى الشيت بنفس الطريقه اللى اشتغلنا بيها الاسبوع ده ويكونوا جاهزين معاكوا الاسبوع القادم ان شاء الله عشان ها نشتغل ع الجهاز ع طول وياريت الناس تراجع الشغل القديم الخاص بال mux , decoder ,.... كما انطلب منكم بالمحاضره ......بالتوفيق"
  },
  {
    "authorName": "Mervat Said",
    "authorLink": "https://www.facebook.com/mervat.said2",
    "link": "https://www.facebook.com/groups/2401660223266519/permalink/2753572934741911/",
    "date": "1582460497",
    "message": "السلام عليكم ورحمة الله\n\nالبشمهندسة مروة بتبلغكوا انها هتبداء بكرا من 9 الي 10و30 ومن 10و30 الي12 سكاشن مادة\" FPGA\" .\n\nوبالتوفيق للجميع"
  }
]